InformationRegisters/Renault_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_СертификатКонтроля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапрещенныеШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗапрещенныеШтрихКоды</Name>
			<Comment>Список запрещенных штрих кодов (можно задавать по маске)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоПрефикс</Name>
					<Comment>Истина - это префикс штрих кода, Ложь - это штрихкод</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих код (или префикс). Префикс задается тем, что после цифр указывается символ *</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатОтветственности</Name>
					<Comment>О материальной ответственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Истина - вести учет в в валюте учета номенклатуры, Ложь - в валюте типа цены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Истина - цена включает НДС, ложь - цена НДС не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабот</Name>
					<Comment>Тип цен используется для работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТоваров</Name>
					<Comment>Тип цен используется для товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтомобилей</Name>
					<Comment>Тип цен используется для автомобилей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТипыЦенПоиска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/Renault_ВыборОбщихРеквизитов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецСсылка = Параметры.Ссылка;
	
	Если Не Параметры.Свойство("ПодразделениеКомпании") Тогда
		Элементы.ПодразделениеКомпании.Доступность = Ложь;
	Иначе
		ПодразделениеКомпании = Параметры.ПодразделениеКомпании;		 
	КонецЕсли;
	
	Если Не Параметры.Свойство("Организация") Тогда
		Элементы.Организация.Доступность = Ложь;
	Иначе
		Организация = Параметры.Организация;		 
	КонецЕсли;
	
	Если Не Параметры.Свойство("Проект") Тогда
		Элементы.Проект.Доступность = Ложь;
	Иначе
		Проект = Параметры.Проект;		 
	КонецЕсли;
	
	Если Не Параметры.Свойство("Автор") Тогда
		Элементы.Автор.Доступность = Ложь;
	Иначе
		Автор = Параметры.Автор;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Менеджер") Тогда
		Элементы.Менеджер.Доступность = Ложь;
	Иначе
		Менеджер = Параметры.Менеджер;		 
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		Элементы.ДокументОснование.ОграничениеТипа = ВладелецСсылка.Метаданные().Реквизиты.ДокументОснование.Тип;
		ДокументОснование = Параметры.ДокументОснование;
	Иначе
		Элементы.ДокументОснование.Доступность = Ложь;	
	КонецЕсли;
	
	Если Не Параметры.Свойство("РегламентированныйУчет") Тогда
		Элементы.РегламентированныйУчет.Доступность=Ложь;
	Иначе
		РегламентированныйУчет = Параметры.РегламентированныйУчет;		 
	КонецЕсли;

	Если НЕ ВладелецСсылка.Пустая() Тогда
		ОбъектыШК = Метаданные.РегистрыСведений.Renault_ШтрихКоды.Измерения.Объект.Тип;
		Если ОбъектыШК.СодержитТип(ТипЗнч(ВладелецСсылка)) Тогда
			ИспользованиеШтрихКодов = Истина;
			Элементы.грШтрихКод.Доступность = Истина;
			Элементы.ШтрихКод.Доступность = Истина;
			//Об = ВладелецСсылка.ПолучитьОбъект();
			ОбработкаОбъектШтрихКоды.Объект = ВладелецСсылка;			
			ОбработкаОбъектШтрихКоды.Состав.Очистить();
			ОбработкаОбъектШтрихКоды.Состав.Загрузить(ПрочитатьЗаполнитьШтрихКоды(ВладелецСсылка));
			Если ОбработкаОбъектШтрихКоды.Состав.Количество() > 0 Тогда
				ШтрихКод = ОбработкаОбъектШтрихКоды.Состав[0].ШтрихКод;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

// Процедура заполняет табличную часть обработки штрихкодами объекта.
// Объект - объект, штрихкоды которого отбираются.
//
// Параметры:
//  Нет.
//
&НаСервере
Функция ПрочитатьЗаполнитьШтрихКоды(Ссылка) Экспорт
	Запрос = Новый Запрос();	
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ТипЗнч(Ссылка)=Тип("СправочникСсылка.Номенклатура") И НЕ Ссылка = Неопределено Тогда
		ИспользованиеШтрихКодов=Ссылка.ТипНоменклатуры.ИспользованиеШтрихКодов;
		Если ИспользованиеШтрихКодов=2 Тогда
			// используем ШК для единиц
			ПодчинитьТипу=(Ссылка.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1);
		ИначеЕсли ИспользованиеШтрихКодов=3 Тогда
			// используем ШК для характеристик
			ПодчинитьТипу=(Ссылка.ТипНоменклатуры.ИспользованиеХарактеристик=1);
		КонецЕсли;
		ПодчинитьТипу=Ложь;
		// смотрим чему у нас подчинены единицы измерения и характеристики
		Если ИспользованиеШтрихКодов=Неопределено Тогда
			//Это для карточек
			ПодчинитьТипу=Неопределено;
		Иначе
			Если ИспользованиеШтрихКодов=2 Тогда
				// используем ШК для единиц
				ПодчинитьТипу=(Ссылка.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1);
			ИначеЕсли ИспользованиеШтрихКодов=3 Тогда
				// используем ШК для характеристик
				ПодчинитьТипу=(Ссылка.ТипНоменклатуры.ИспользованиеХарактеристик=1);
			КонецЕсли;
			Запрос.УстановитьПараметр("Владелец", ?(ПодчинитьТипу,Ссылка.ТипНоменклатуры,Ссылка));
		КонецЕсли;
		Запрос.УстановитьПараметр("Владелец", ?(ПодчинитьТипу,Ссылка.ТипНоменклатуры,Ссылка));
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ШтрихКоды."+?(ИспользованиеШтрихКодов=1,"Объект",?(ИспользованиеШтрихКодов=2,"ЕдиницаИзмерения","ХарактеристикаНоменклатуры"))+" КАК Объект,
		|	ШтрихКоды.ШтрихКод,
		|	ШтрихКоды.Запрет КАК Запрещен
		|ИЗ
		|	РегистрСведений.Renault_ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Объект=&Ссылка
		|УПОРЯДОЧИТЬ ПО Объект
		|";
	Иначе
		Запрос.Текст="ВЫБРАТЬ
				 |	ШтрихКоды.Объект КАК Объект,
				 |	ШтрихКоды.ШтрихКод,
				 |	ШтрихКоды.Запрет КАК Запрещен
				 |ИЗ
				 |	РегистрСведений.Renault_ШтрихКоды КАК ШтрихКоды
				 |ГДЕ
				 |	ШтрихКоды.Объект=&Ссылка";
	КонецЕсли;  
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПрочитатьЗаполнитьШтрихКоды()

&НаКлиенте
Процедура Применить(Команда)
	
	ВладелецОбъект = ВладелецФормы.Объект;
	
	Если Элементы.ПодразделениеКомпании.Доступность И ПодразделениеКомпании.Пустая() Тогда
		Предупреждение("Не указано подразделение!");
		Возврат;
	КонецЕсли; 
	Если Элементы.Организация.Доступность И Организация.Пустая() Тогда
		Предупреждение("Не указана организация!");
		Возврат;
	КонецЕсли; 
	Если Элементы.Автор.Доступность И Автор.Пустая() Тогда
		Предупреждение("Не указан автор!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	
	МаскаПрефиксации = Неопределено;
	//Попытка МаскаПрефиксации = обПраво("Режим префиксации " + ВладелецОбъект.Ссылка.Метаданные().Имя,глПрава);
	//Исключение КонецПопытки;	
	
	Попытка
		ВладелецФормыПодразделениеКомпании = ВладелецОбъект.ПодразделениеКомпании;
	Исключение
	КонецПопытки; 
	Попытка
		ВладелецФормыОрганизация = ВладелецОбъект.Организация;
	Исключение
	КонецПопытки; 
	Попытка
		ВладелецФормыРегламентированныйУчет = ВладелецОбъект.РегламентированныйУчет;
	Исключение
	КонецПопытки; 
	Попытка
		ВладелецФормыМенеджер = ВладелецОбъект.Менеджер;
	Исключение
	КонецПопытки; 
	Попытка
		ВладелецФормыДокументОснование = ВладелецОбъект.ДокументОснование;
	Исключение
	КонецПопытки; 
	Попытка
		ВладелецФормыПроект = ВладелецОбъект.Проект;
	Исключение
	КонецПопытки; 

	НужноПроверитьНомер = Ложь;
	НужноИзменитьДоговор = Ложь;
	//Попытка записи в форму-владельца выбранных параметров
	Попытка
		Если (ВладелецОбъект.ПодразделениеЗатрат = ВладелецФормыПодразделениеКомпании) И 
			 (ВладелецФормыПодразделениеКомпании <> ПодразделениеКомпании) Тогда
			 ПараметрыФормы.Вставить("ПодразделениеЗатрат",ПодразделениеКомпании);
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		Если (ВладелецФормыПодразделениеКомпании <> ПодразделениеКомпании) Тогда
			ПараметрыФормы.Вставить("ПодразделениеКомпании",ПодразделениеКомпании);
			Если Найти(МаскаПрефиксации,"[П]") <> 0 Тогда
				НужноПроверитьНомер = Истина;
			КонецЕсли; 
			НужноИзменитьДоговор = Истина;
		КонецЕсли;
	Исключение КонецПопытки; 
	
	Попытка
		Если (ВладелецФормыОрганизация <> Организация) Тогда
			ПараметрыФормы.Вставить("Организация",Организация);
			Если Найти(МаскаПрефиксации,"[О]") <> 0 Тогда
				НужноПроверитьНомер = Истина;
			КонецЕсли; 
			НужноИзменитьДоговор = Истина;
		КонецЕсли;
	Исключение 
	КонецПопытки; 
	
	Попытка
		Если (ВладелецФормыПроект <> Проект) Тогда
			ПараметрыФормы.Вставить("Проект",Проект);
		КонецЕсли;
	Исключение 
	КонецПопытки; 

	Попытка
		Если (ВладелецФормыРегламентированныйУчет <> РегламентированныйУчет) Тогда
			ПараметрыФормы.Вставить("РегламентированныйУчет",РегламентированныйУчет);
		КонецЕсли;
	Исключение 
	КонецПопытки; 
	
	ПараметрыФормы.Вставить("Автор",Автор);
	
	Попытка 
		Если ВладелецФормыМенеджер <> Менеджер Тогда
			ПараметрыФормы.Вставить("Менеджер",Менеджер); 
		КонецЕсли; 
	Исключение КонецПопытки; 
	
	Попытка 
		Если ВладелецФормыДокументОснование <> ДокументОснование Тогда
			ПараметрыФормы.Вставить("ДокументОснование",ДокументОснование); 
		КонецЕсли; 
	Исключение КонецПопытки; 
	
	//// покрасим поле организации, подразделения в случае если документ не принадлежит к регламентированному учету
	//Попытка 
	//	Если НЕ ВладелецОбъект.РегламентированныйУчет Тогда
	//		ВладелецФормы.Элементы.ОрганизацияПодразделение.ЦветФона = ЦветаСтиля.ЦветПоляНерегламентированногоУчета;
	//	Иначе
	//		ВладелецФормы.Элементы.ОрганизацияПодразделение.ЦветФона = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;	
	
	//// проведем проверку правильности номера
	//Если НужноПроверитьНомер Тогда
	//	Попытка дкПроверитьКорректностьНомераИДаты(ВладелецОбъект); Исключение КонецПопытки; 
	//КонецЕсли;
	
	//если изменились организация или подразделение, то изменим договор
	Если НужноИзменитьДоговор Тогда
		Попытка
					
			ВидДоговора = ВладелецОбъект.ДоговорВзаиморасчетов.ВидДоговора;
			ДопПараметры = Новый Структура;
			
			//если в форме документа не заполнено договор взаиморасчетов, 
			//то выберем вид договора согласно хоз операции	и заполним ДопПараметры
			ЕстьТипЦен = (ВладелецОбъект.Метаданные().Реквизиты.Найти("ТипЦен") <> Неопределено);
			Если (ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ОтгрузкаТМЦ")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ОтгрузкаАвтомобилей")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказыНаОтгрузку")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ПрочиеАктивы")) Тогда
				Если Не ЗначениеЗаполнено(ВидДоговора) Тогда
					ВидДоговора=ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа");
				КонецЕсли; 
				ДопПараметры.Вставить("ТипЦенПокупки",ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"));
				ДопПараметры.Вставить("ТипЦенПродажи",?(ЕстьТипЦен,ВладелецОбъект.ТипЦен,ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка")));
			ИначеЕсли (ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТМЦ")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ПоставкаАвтомобилей")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.Ценообразование")) ИЛИ
				(ВладелецОбъект.ХозОперация.Родитель = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказыНаПоставку")) Тогда
				Если Не ЗначениеЗаполнено(ВидДоговора) Тогда
					ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка");
				КонецЕсли; 
				ДопПараметры.Вставить("ТипЦенПокупки",?(ЕстьТипЦен,ВладелецОбъект.ТипЦен,ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка")));
				ДопПараметры.Вставить("ТипЦенПродажи",ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"));
			Иначе                
				Если Не ЗначениеЗаполнено(ВидДоговора) Тогда
					ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Прочее");
				КонецЕсли; 
				ДопПараметры.Вставить("ТипЦенПокупки",ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"));
				ДопПараметры.Вставить("ТипЦенПродажи",ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"));
			КонецЕсли;

			ДопПараметры.Вставить("ВидДоговора",ВидДоговора);
			
			Попытка
				ДопПараметры.Вставить("ВалютаВзаиморасчетов", ВладелецОбъект.ВалютаДокумента);
            Исключение
			КонецПопытки; 

			НовыйДоговорВзаиморасчетов = ПолучитьДоговорВзаиморасчетов(ВладелецОбъект.Контрагент,ВидДоговора,ВладелецОбъект,ДопПараметры,Истина);
			Если ВладелецОбъект.ДоговорВзаиморасчетов <> НовыйДоговорВзаиморасчетов Тогда
				ПараметрыФормы.Вставить("ДоговорВзаиморасчетов",НовыйДоговорВзаиморасчетов);
			КонецЕсли; 
		Исключение КонецПопытки;
	КонецЕсли;

	Если ИспользованиеШтрихКодов Тогда
		Если ОбработкаОбъектШтрихКоды.Состав.Количество() = 0 Тогда
			СтрокаШК = ОбработкаОбъектШтрихКоды.Состав.Добавить();
			СтрокаШК.Объект = ОбработкаОбъектШтрихКоды.Объект;
			СтрокаШК.Запрещен = Ложь;
		Иначе
			СтрокаШК = ОбработкаОбъектШтрихКоды.Состав[0];
		КонецЕсли; 
		СтрокаШК.ШтрихКод = ШтрихКод;
		Если НЕ ЗаписатьШтрихКоды(ОбработкаОбъектШтрихКоды.Объект) Тогда
			//Произошла ошибка
			ТекстОшибки = "Ошибка записи штрих-кода документа.";
			Сообщить(ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;	
	
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ПодразделениеКомпании",ПодразделениеКомпании);	
	//ПараметрыФормы.Вставить("Организация",Организация);	
	//ПараметрыФормы.Вставить("Автор",Автор);
	//Если Элементы.Менеджер.Доступность Тогда
	//	ПараметрыФормы.Вставить("Менеджер",Менеджер);
	//КонецЕсли;
	//Если Элементы.Проект.Доступность Тогда
	//	ПараметрыФормы.Вставить("Проект",Проект);
	//КонецЕсли;
	//Если Элементы.РегламентированныйУчет.Доступность Тогда
	//	ПараметрыФормы.Вставить("РегламентированныйУчет",РегламентированныйУчет);
	//КонецЕсли;
	//Если Элементы.ДокументОснование.Доступность Тогда
	//	ПараметрыФормы.Вставить("ДокументОснование",ДокументОснование);
	//КонецЕсли;	
	
	Оповестить("ЗакрытьФормуВыбораОбщихРеквизитов",ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

// Функция записывает значения штрихкодов в информационную базу.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если значения штрихкоды были записаны, или их не требуется записывать
//  Ложь   - если значения штрихкоды не удалось записать.
Функция ЗаписатьШтрихКоды(Ссылка) Экспорт
	НаборЗаписейШтрихКоды = РегистрыСведений.Renault_ШтрихКоды.СоздатьНаборЗаписей();

	Если ТипЗнч(Ссылка)=Тип("СправочникСсылка.Номенклатура") Тогда
		ИспользованиеШтрихКодов = Ссылка.ТипНоменклатуры.ИспользованиеШтрихКодов;
	Иначе
		ИспользованиеШтрихКодов = Неопределено;
	КонецЕсли;
	
	Для Каждого Строка Из ОбработкаОбъектШтрихКоды.Состав Цикл
		//Строка.ШтрихКод=СокрЛП(Строка.ШтрихКод);
		Если обЗначениеНеЗаполнено(Строка.ШтрихКод) Тогда Продолжить; КонецЕсли;
		Если НЕ ШтрихКодУникален(Строка.ШтрихКод) Тогда
			Сообщить(Строка.ШтрихКод+" - штрихкод не уникален! Штрихкод не записан!",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		Если ШтрихКодЗапрещен(Строка.ШтрихКод) Тогда
			Сообщить(Строка.ШтрихКод+" - штрихкод запрещен! Штрихкод не записан!",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписейШтрихКоды.Добавить();
		Запись.Объект   = Ссылка;
		Запись.ШтрихКод = Строка.ШтрихКод;
		Запись.Запрет = Строка.Запрещен;
		Если ИспользованиеШтрихКодов <> Неопределено Тогда
			Если ИспользованиеШтрихКодов = 2 Тогда
				Запись.ЕдиницаИзмерения = Строка.Объект;
			ИначеЕсли ИспользованиеШтрихКодов = 3 Тогда
				Запись.ХарактеристикаНоменклатуры = Строка.Объект;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;

	НаборЗаписейШтрихКоды.Отбор.Объект.Установить(Ссылка);

	Попытка
		НаборЗаписейШтрихкоды.Записать();
	Исключение
		Сообщить("Не удалось записать штрихкод:" + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции // ЗаписатьШтрихКоды()

// Функция проверяет уникальность штрихкода
//
// Параметры
//  <ШтрихКод>  – Проверяемый штрихкод
//                 <продолжение описания параметра>
// Возвращаемое значение:
//  Истина - если код уникальный
//  Ложь   - если код неуникальный
Функция ШтрихКодУникален(ШтрихКод) Экспорт
	Если ПустаяСтрока(ШтрихКод) Тогда
		Возврат Истина; // проверять нечего, говорим что все Ок
	КонецЕсли;
	// первый шаг. Проверим уникальность ШК в регистре
	Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.УстановитьПараметр("Объект", ОбработкаОбъектШтрихКоды.Объект);
	Запрос.Текст = "
    |ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.Объект
	|ИЗ
	|	РегистрСведений.Renault_ШтрихКоды КАК ШтрихКоды
    |ГДЕ
	|	ШтрихКоды.ШтрихКод=&ШтрихКод И ШтрихКоды.Объект<>&Объект";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// проверку не прошел
	    Возврат Ложь;
	Иначе
		// шаг 2. Проверим уникальность ШК среди строк таблицы "Состав"
		МассивСтрок=ОбработкаОбъектШтрихКоды.Состав.НайтиСтроки(Новый Структура("ШтрихКод",ШтрихКод));
		Возврат (МассивСтрок.Количество()<2);
	КонецЕсли; 
	
КонецФункции // ШтрихКодУникален()

// Функция проверяет штрих код на наличие в списке запрещенных штрих кодов
//
// Параметры
//  <ШтрихКод>  – Проверяемый штрихкод
// Возвращаемое значение:
//  Истина - если код запрещен
//  Ложь   - если код разрешен
Функция ШтрихКодЗапрещен(ШтрихКод) Экспорт
	//ШК=СокрЛП(ШтрихКод);
	ШК=Строка(ШтрихКод);
	НайденныйШК="";
	// 1. ищем ШК
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	ЗапрещенныеШтрихКоды.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихКоды
	|ГДЕ
	|	НЕ ЗапрещенныеШтрихКоды.ЭтоПрефикс И ЗапрещенныеШтрихКоды.ШтрихКод = &ШтрихКод");
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Результат=Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		НайденныйШК=Результат.Выгрузить().Получить(0).ШтрихКод;
	КонецЕсли;
	
	// 2. если не нашли ШК, то поищем префикс
	Если ПустаяСтрока(НайденныйШК) Тогда
		Запрос=Новый Запрос("
		|ВЫБРАТЬ
		|	ЗапрещенныеШтрихКоды.ШтрихКод КАК Префикс
		|ИЗ
		|	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихКоды
		|ГДЕ
		|	ЗапрещенныеШтрихКоды.ЭтоПрефикс");
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Сред(ШК,1,СтрДлина(Выборка.Префикс))=СокрЛП(Выборка.Префикс) Тогда
				НайденныйШК=Выборка.Префикс; Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат НЕ ПустаяСтрока(НайденныйШК)
КонецФункции // ШтрихКодЗапрещен()


// Получение договора взаиморасчетов контрагента с заданными параметрами.
// Если договора заданного типа нет - создается новый договор.
//
// Параметры:
// Контрагент	– СправочникСсылка.Контрагенты – Ссылка на справочник контрагентов,
//				 договор которого требуется получить.
// ВидДоговора	– ПеречислениеСсылка.ВидыДоговоров – Ссылка на перечисление вида получаемого договора.
//	ЭтотОбъект	- ДокументОбъект - Документ, в рамках которого производится создание нового договора.
//				 Если значение неопределено параметры договора беруться из настроек.
//	ДопПараметры - Структура - Структура, содержащая тип цен покупки и продажи для заполнения нового договора.
//				 Если значение неопределено или не определен тот или иной тип цен - они берутся из настроек.
// УчитыватьПодразделение - Булево, определяет нужно ли дополнительно проверять соответствие подразделения
//				 основного договора с данными объекта
//
// Возвращаемое значение:
// СправочникСсылка.ДоговорыВзаиморасчетов – Ссылка на справочник ДоговорыВзаиморасчетов с найденным договором
//											 или вновь созданным.
Функция ПолучитьДоговорВзаиморасчетов(Контрагент,ВидДоговора,ЭтотОбъект = Неопределено,ДопПараметры = Неопределено, УчитыватьПодразделение = Ложь) Экспорт
	Если ВидДоговора = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(Контрагент).ВидДоговора И НЕ УчитыватьПодразделение Тогда
		//Запрашиваемый вид договора - это основной договор взаиморасчетов контрагента
		Возврат CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(Контрагент);
	Иначе
		//Проверим есть ли уже договора данного вида
		
		ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
		ПустоеПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
		ПустаяДата = Дата("00010101");
		Попытка Организация = ЭтотОбъект.Организация; Исключение Организация = ПустаяОрганизация; КонецПопытки;
		Попытка ПодразделениеКомпании = ЭтотОбъект.ПодразделениеКомпании; Исключение ПодразделениеКомпании = ПустоеПодразделение; КонецПопытки;
		Попытка ДатаДоговора = ЭтотОбъект.Дата; Исключение ДатаДоговора = ПустаяДата; КонецПопытки;
		ПраваПользователя = ?(ЭтотОбъект = Неопределено,Неопределено,ЭтотОбъект.Права);
		Если ДопПараметры = Неопределено Тогда
			ВалютаВзаиморасчетов = Неопределено;
		Иначе
			ДопПараметры.Свойство("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
		КонецЕсли;
		
		// В первую очередь необходимо получить договор, удовлетворяющий 
		// всем условиям, в т.ч. у которого совпадают реквизиты "Подразделение компании" и "Организация".
		// Если такого договора нет, то необходимо попытаться получить договор, у которого хотя бы организация совпадет.
		// Если и такого договора нет, то пытаемся получить договор, у которого подразделение совпадает. 
		// Если и такого нет, то получаем любой договор (в пределах подчинения, разумеется).
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыВзаиморасчетов.Ссылка КАК Договор,
		|	ВЫБОР
		|	КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|			И ДоговорыВзаиморасчетов.Подразделение = &Подразделение
		|		ТОГДА 0
		|	ИНАЧЕ ВЫБОР
		|			КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|				ТОГДА 1
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ДоговорыВзаиморасчетов.Подразделение = &Подразделение
		|						ТОГДА 2
		|					ИНАЧЕ 3
		|				КОНЕЦ
		|		КОНЕЦ
		|	КОНЕЦ КАК ПолеДляСортировки
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &Владелец
		|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
		|	И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
		|				И ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаДоговора
		|			ИЛИ &ДатаДоговора МЕЖДУ ДоговорыВзаиморасчетов.ДатаНачала И ДоговорыВзаиморасчетов.ДатаКонца)
		|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ"
		 + ?(ВалютаВзаиморасчетов = Неопределено, "", "
		| И ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов") + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолеДляСортировки ВОЗР,
		|	ВЫБОР
		|		КОГДА ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ ВОЗР,
		|	ДоговорыВзаиморасчетов.ДатаКонца,
		|	ДоговорыВзаиморасчетов.ДатаНачала УБЫВ";
		
		Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
		Запрос.УстановитьПараметр("Владелец", Контрагент);
		Запрос.УстановитьПараметр("Организация",?(обЗначениеНеЗаполнено(Организация), ПараметрыСеанса.Организация, Организация));
		Запрос.УстановитьПараметр("Подразделение",?(обЗначениеНеЗаполнено(ПодразделениеКомпании), ПараметрыСеанса.ПодразделениеКомпании, ПодразделениеКомпании));
		Запрос.УстановитьПараметр("ДатаДоговора",ДатаДоговора);
		Запрос.УстановитьПараметр("ПустаяДата",ПустаяДата);
		Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			//Договор требуемого вида уже есть - вернем его
			Выборка = Результат.Выбрать(); 
			Выборка.Следующий();
			Возврат Выборка.Договор;
			
		ИначеЕсли обПраво("АвтоматическоеСозданиеОсновногоДоговора",ПраваПользователя,,ЭтотОбъект) И НЕ (Контрагент.ВидКонтрагента=Перечисления.ВидыКонтрагентов.КонтактноеЛицо) Тогда
			Если ЭтотОбъект = Неопределено Тогда
				//Если документа нет, параметры договора будут подставлены по умолчанию
				Организация = Справочники.Организации.ПустаяСсылка();
				Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
				ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				#Если Клиент Тогда
				ДатаНачала= РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
			    ДатаНачала = ТекущаяДата();
				#КонецЕсли
				ДатаНачала = НачалоДня(ДатаНачала);
				ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
			Иначе
				//Если есть документ, параметры договора беруться из него
				Организация = ЭтотОбъект.Организация;
				Подразделение = ЭтотОбъект.ПодразделениеКомпании;
				Попытка
					ВалютаВзаиморасчетов = ЭтотОбъект.ВалютаДокумента;
				Исключение
					ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				КонецПопытки; 
				ДатаНачала = ЭтотОбъект.Дата;
				Попытка ВидОплаты = ЭтотОбъект.ВидОплаты;
				Исключение ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				КонецПопытки; 
				Попытка
					ТипСкидкиНаценки = ЭтотОбъект.СкидкаНаценка;
					Если НЕ ТипСкидкиНаценки.РучнаяСкидка Тогда
						ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
					КонецЕсли; 
				Исключение
					ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
				КонецПопытки; 
			КонецЕсли; 
			Если обЗначениеНеЗаполнено(Организация) Тогда Организация = ПараметрыСеанса.Организация; КонецЕсли; 
			Если обЗначениеНеЗаполнено(Подразделение) Тогда Подразделение = ПараметрыСеанса.ПодразделениеКомпании; КонецЕсли; 
			ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", ПраваПользователя,,ЭтотОбъект);
			ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", ПраваПользователя,,ЭтотОбъект);
			ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   ПраваПользователя,,ЭтотОбъект);
			Если ДопПараметры <> Неопределено Тогда
				ДопПараметры.Свойство("ТипЦенПокупки", ТипЦенПокупки);
				ДопПараметры.Свойство("ТипЦенПродажи", ТипЦенПродажи);
				ДопПараметры.Свойство("ТипЦенРабот",   ТипЦенРабот);
			КонецЕсли;
			//иначе создадим новый
			НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
			НовыйДоговор.УстановитьНовыйКод();
			НовыйДоговор.Владелец      = Контрагент;
			НовыйДоговор.Организация   = Организация;
			НовыйДоговор.Подразделение = Подразделение;
			НовыйДоговор.ВидДоговора   = ВидДоговора;
			НовыйДоговор.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
			НовыйДоговор.ДатаНачала    = ДатаНачала;
			НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
			НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
			НовыйДоговор.ТипЦенРабот   = ТипЦенРабот;
			НовыйДоговор.ВидОплаты     = ВидОплаты;
			НовыйДоговор.ТипСкидкиНаценки = ТипСкидкиНаценки;
			НовыйДоговор.СформироватьНаименование();
			НовыйДоговор.ПроверятьЗаполнение = Ложь;
			Если Метаданные.Справочники.ДоговорыВзаиморасчетов.Реквизиты.Найти("Основной") <> Неопределено Тогда
				НовыйДоговор.Основной = Истина;
			КонецЕсли;
			НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
			Попытка
				НовыйДоговор.Записать();
			Исключение КонецПопытки;
			Если Метаданные.Справочники.Контрагенты.Реквизиты.Найти("ОсновнойДоговорВзаиморасчетов") <> Неопределено
				И обЗначениеНеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(Контрагент)) Тогда
				КонтрагентОбъект = Контрагент.ПолучитьОбъект();
				КонтрагентОбъект.ОсновнойДоговорВзаиморасчетов = НовыйДоговор.Ссылка;
				Попытка
					КонтрагентОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;	
			Возврат НовыйДоговор.Ссылка;
		Иначе
			Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;	
КонецФункции // дкПолучитьДоговорВзаиморасчетов()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры
